// Написать программу которая принимает два числа и проверяет является ли первое число квадратом второго
double number1 = 3;
double number2 = 25;

if (number1 == Math.Sqrt(number2))      
    Console.WriteLine ("все верно");
else
    Console.WriteLine ("проверь условие");

Console.WriteLine();

